0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (24.1481 6.4705 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (24.1481 6.4705 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (24.1481 6.4705 0);
        value           uniform (24.1481 6.4705 0);
    }

    farfield
    {
        type            freestream;
        freestreamValue uniform (24.1481 6.4705 0);
    }

    wing
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}