constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

mover
{
    type motionSolver;

    libs ("libfvMeshMovers.so" "libfvMotionSolvers.so");

    motionSolver displacementLaplacian;

    displacementLaplacianCoeffs
    {
        diffusivity inverseDistance (wing);
    }
}