constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          82;
        startFace       22023;
    }
    outlet
    {
        type            patch;
        nFaces          97;
        startFace       22105;
    }
    farfield
    {
        type            patch;
        nFaces          148;
        startFace       22202;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          83;
        startFace       22350;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          22228;
        startFace       22433;
    }
)

// ************************************************************************* //
