system/blockMeshDict
																
FoamFile																	
{																	
    version     2.0;																	
    format      ascii;																	
    class       dictionary;																	
    object      blockMeshDict;																	
}																	
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //																	
convertToMeters	1	;															
																	
geometry																	
{																	
}																	
																	
vertices
(
    ( 0  0    0   ) // 0
    ( 1  0    0   ) // 1  
    ( 1  12   0   ) // 2
    (-11 0    0   ) // 3
    ( 0  0    0.3 ) // 4
    ( 1  0    0.3 ) // 5 
    ( 1  12   0.3 ) // 6
    (-11 0    0.3 ) // 7
    ( 21 0    0   ) // 8
    ( 21 12   0   ) // 9
    ( 21 0    0.3 ) // 10
    ( 21 12   0.3 ) // 11
    ( 1  -12  0   ) // 12
    ( 1  -12  0.3 ) // 13
    ( 21 -12  0   ) // 14
    ( 21 -12  0.3 ) // 15
    ( 1  -0.001  0   ) // 16 lower trailing edge
    ( 1  -0.001  0.3 ) // 17 lower trailing edge
    ( 21 -0.001  0   ) // 18 lower wake at outlet
    ( 21 -0.001  0.3 ) // 19 lower wake at outlet
);							
																	
																	
blocks																	
(																	
	hex	(0	1	2	3	4	5	6	7)	(	41	48	1	)	//block	1	
	edgeGrading																
	(																
	//	x-direction	expansion	ratio													
	(																
(	0.4	0.512195122	3.5	)													
(	0.6	0.487804878	0.857142857	)													
	)																
	0.03	0.03															
	(																
(	0.4	0.512195122	3.5	)													
(	0.6	0.487804878	0.857142857	)													
	)																
	//	y-direction	expansion	ratio													
	(																
(	0.041666667	0.354166667	22.18611107	)													
(	0.958333333	0.645833333	9.014648822	)													
	)																
	(																
(	0.041666667	0.354166667	22.18611107	)													
(	0.958333333	0.645833333	9.014648822	)													
	)																
	(																
(	0.041666667	0.354166667	22.18611107	)													
(	0.958333333	0.645833333	9.014648822	)													
	)																
	(																
(	0.041666667	0.354166667	22.18611107	)													
(	0.958333333	0.645833333	9.014648822	)													
	)																
																	
	//	z-direction	expansion	ratio													
	1	1	1	1													
	)																
																	
	hex	(1	8	9	2	5	10	11	6)	(	74	48	1)	//block	2		
	edgeGrading																
	(																
	//	x-direction	expansion	ratio													
	33.33333333	33.33333333	33.33333333	33.33333333													
	//	y-direction	expansion	ratio													
	(																
(	0.041666667	0.354166667	22.18611107	)													
(	0.958333333	0.645833333	9.014648822	)													
	)																
	13.95816592	13.95816592															
	(																
(	0.041666667	0.354166667	22.18611107	)													
(	0.958333333	0.645833333	9.014648822	)													
	)																
																	
	//	z-direction	expansion	ratio													
	1	1	1	1													
	)																
																	
	hex	(3	12	16	0	7	13	17	4)	(	41	48	1	)	//block	3	
	edgeGrading																
	(																
	//	x-direction	expansion	ratio													
	0.03																
	(																
(	0.4	0.512195122	3.5	)													
(	0.6	0.487804878	0.857142857	)													
	)																
	(																
(	0.4	0.512195122	3.5	)													
(	0.6	0.487804878	0.857142857	)													
	)																
	0.03																
	//	y-direction	expansion	ratio													
	(																
(	0.958333333	0.645833333	0.110930555	)													
(	0.041666667	0.354166667	0.045073244	)													
	)																
	(																
(	0.958333333	0.645833333	0.110930555	)													
(	0.041666667	0.354166667	0.045073244	)													
	)																
	(																
(	0.958333333	0.645833333	0.110930555	)													
(	0.041666667	0.354166667	0.045073244	)													
	)																
	(																
(	0.958333333	0.645833333	0.110930555	)													
(	0.041666667	0.354166667	0.045073244	)													
	)																
																	
	//	z-direction	expansion	ratio													
	1	1	1	1													
	)																
																	
																	
																	
																	
																	
	hex	(12	14	18	16	13	15	19	17)	(	74	48	1)	//block	4		
	edgeGrading																
	(																
	//	x-direction	expansion	ratio													
	33.33333333	33.33333333	33.33333333	33.33333333													
	//	y-direction	expansion	ratio													
	(																
(	0.958333333	0.645833333	0.110930555	)													
(	0.041666667	0.354166667	0.045073244	)													
	)																
	0.07164265	0.07164265															
	(																
(	0.958333333	0.645833333	0.110930555	)													
(	0.041666667	0.354166667	0.045073244	)													
	)																
																	
	//	z-direction	expansion	ratio													
	1	1	1	1													
	)																

    
    hex (16 18 8 1 17 19 10 5) (74 1 1)
    simpleGrading (33.33333333 1 1)
);																	
																	
																	
edges																	
(																	
	arc	3 2	(	-7.485281374	8.485281374	0	)										
	arc	7 6	(	-7.485281374	8.485281374	0.3	)										
																	
	spline 1 0
    (
        (0.95000 0.00807 0)
        (0.90000 0.01448 0)
        (0.85000 0.02053 0)
        (0.80000 0.02623 0)
        (0.75000 0.03160 0)
        (0.70000 0.03664 0)
        (0.65000 0.04133 0)
        (0.60000 0.04563 0)
        (0.55000 0.04952 0)
        (0.50000 0.05294 0)
        (0.44900 0.05588 0)
        (0.39900 0.05808 0)
        (0.34900 0.05951 0)
        (0.29900 0.06002 0)
        (0.27500 0.06048 0)
        (0.25000 0.06084 0)
        (0.22500 0.06100 0)
        (0.20000 0.06087 0)
        (0.17500 0.06033 0)
        (0.15000 0.05924 0)
        (0.12500 0.05740 0)
        (0.10000 0.05454 0)
        (0.08000 0.05121 0)
        (0.06000 0.04655 0)
        (0.05000 0.04351 0)
        (0.04000 0.03982 0)
        (0.03000 0.03522 0)
        (0.02000 0.02925 0)
        (0.01000 0.02074 0)
        (0.00500 0.01438 0)
    )												
																	
																	
	   spline 5 4
    (
        (0.95000 0.00807 0.3)
        (0.90000 0.01448 0.3)
        (0.85000 0.02053 0.3)
        (0.80000 0.02623 0.3)
        (0.75000 0.03160 0.3)
        (0.70000 0.03664 0.3)
        (0.65000 0.04133 0.3)
        (0.60000 0.04563 0.3)
        (0.55000 0.04952 0.3)
        (0.50000 0.05294 0.3)
        (0.44900 0.05588 0.3)
        (0.39900 0.05808 0.3)
        (0.34900 0.05951 0.3)
        (0.29900 0.06002 0.3)
        (0.27500 0.06048 0.3)
        (0.25000 0.06084 0.3)
        (0.22500 0.06100 0.3)
        (0.20000 0.06087 0.3)
        (0.17500 0.06033 0.3)
        (0.15000 0.05924 0.3)
        (0.12500 0.05740 0.3)
        (0.10000 0.05454 0.3)
        (0.08000 0.05121 0.3)
        (0.06000 0.04655 0.3)
        (0.05000 0.04351 0.3)
        (0.04000 0.03982 0.3)
        (0.03000 0.03522 0.3)
        (0.02000 0.02925 0.3)
        (0.01000 0.02074 0.3)
        (0.00500 0.01438 0.3)
    )										
																	
																	
	arc	3 12	(	-7.485281374	-8.485281374	0	)										
	arc	7 13	(	-7.485281374	-8.485281374	0.3	)										
																	
	spline 0 16
    (
        (0.00500 -0.01438 0)
        (0.01000 -0.02074 0)
        (0.02000 -0.02925 0)
        (0.03000 -0.03522 0)
        (0.04000 -0.03982 0)
        (0.05000 -0.04351 0)
        (0.06000 -0.04655 0)
        (0.08000 -0.05121 0)
        (0.10000 -0.05454 0)
        (0.12500 -0.05740 0)
        (0.15000 -0.05924 0)
        (0.17500 -0.06033 0)
        (0.20000 -0.06087 0)
        (0.22500 -0.06100 0)
        (0.25000 -0.06084 0)
        (0.27500 -0.06048 0)
        (0.29900 -0.06002 0)
        (0.34900 -0.05951 0)
        (0.39900 -0.05808 0)
        (0.44900 -0.05588 0)
        (0.50000 -0.05294 0)
        (0.55000 -0.04952 0)
        (0.60000 -0.04563 0)
        (0.65000 -0.04133 0)
        (0.70000 -0.03664 0)
        (0.75000 -0.03160 0)
        (0.80000 -0.02623 0)
        (0.85000 -0.02053 0)
        (0.90000 -0.01448 0)
        (0.95000 -0.00807 0)
    )
							
																	
																	
	 spline 4 17
    (
        (0.00500 -0.01438 0.3)
        (0.01000 -0.02074 0.3)
        (0.02000 -0.02925 0.3)
        (0.03000 -0.03522 0.3)
        (0.04000 -0.03982 0.3)
        (0.05000 -0.04351 0.3)
        (0.06000 -0.04655 0.3)
        (0.08000 -0.05121 0.3)
        (0.10000 -0.05454 0.3)
        (0.12500 -0.05740 0.3)
        (0.15000 -0.05924 0.3)
        (0.17500 -0.06033 0.3)
        (0.20000 -0.06087 0.3)
        (0.22500 -0.06100 0.3)
        (0.25000 -0.06084 0.3)
        (0.27500 -0.06048 0.3)
        (0.29900 -0.06002 0.3)
        (0.34900 -0.05951 0.3)
        (0.39900 -0.05808 0.3)
        (0.44900 -0.05588 0.3)
        (0.50000 -0.05294 0.3)
        (0.55000 -0.04952 0.3)
        (0.60000 -0.04563 0.3)
        (0.65000 -0.04133 0.3)
        (0.70000 -0.03664 0.3)
        (0.75000 -0.03160 0.3)
        (0.80000 -0.02623 0.3)
        (0.85000 -0.02053 0.3)
        (0.90000 -0.01448 0.3)
        (0.95000 -0.00807 0.3)
    )											
																	
																	
);																	
																	
faces																	
(																	
																	
);																	
																	
faces																	
(																	
  																	
);																	
																	
																	
defaultPatch																	
{																	
    name frontAndBack;																	
    type empty;																	
}																	
																	
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 3 7 6)     // Parete curva d'ingresso superiore
            (3 12 13 7)   // Parete curva d'ingresso inferiore
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 11 10)   // Uscita blocco superiore
            (14 18 19 15) // Uscita blocco inferiore
            (18 8 10 19)  // Uscita del sottile blocco di scia
        );
    }
    farfield
    {
        type patch;
        faces
        (
            (9 2 6 11)    // Far-field superiore
            (12 14 15 13) // Far-field inferiore
        );
    }
    wing
    {
        type wall;
        faces
        (
            (1 0 4 5)     // Profilo alare superiore 
            (0 16 17 4)   // Profilo alare inferiore 
            (16 1 5 17)   // Bordo d'uscita finito
        );
    }
);						
																	
 															
// ************************************************************************* //																	
