system/controlDict.motionTest
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     moveDynamicMesh;

libs
(
    "libfvMotionSolvers.so"
);

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2;
deltaT          0.05;

writeControl    timeStep;
writeInterval   1;

writeFormat     ascii;
writePrecision  10;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable false;

// ************************************************************************* //
