system/fvModels
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvModels;
}

motionSolver1
{
    type            meshMotion;
    libs            ("libfvMotionSolvers.so");
}

